gloomyandy/RepRapFirmware/src/Hardware/STM32/Boards/BIQU_SKR.h
#ifndef BIQU_SKR_H
#define BIQU_SKR_H


// List of assignable pins and their mapping from names to MPU ports. This is indexed by logical pin number.
// The names must match user input that has been converted to lowercase and had _ and - characters stripped out.
// Aliases are separate by the , character.
// If a pin name is prefixed by ! then this means the pin is hardware inverted. The same pin may have names for both the inverted and non-inverted cases,
// for example the inverted heater pins on the expansion connector are available as non-inverted servo pins on a DFueX.
#if STM32H7
# if STM32H743xx
constexpr PinEntry PinTable_BIQU_SKR_SE_BX_v2_0[] =
{
    //Thermistors
    {PH_4, "e0temp,th0"},
    {PA_3, "e1temp,th1"},
    {PH_5, "e2temp,thb"},

    //Endstops
    {PB_11, "xstop"},
    {PD_13, "xstopmax"},
    {PB_12, "ystop"},
    {PB_13, "ystopmax"},
    {PD_12, "zstop"},
    {PD_11, "zstopmax"},
	{PH_2, "probe"},
	
    //Heaters and Fans (Big and Small Mosfets}
    {PA_4,  "bed,hbed" },
    {PC_4,  "e0heat,he0" },
    {PC_5,  "e1heat,he1" },
    {PA_5,  "fan0,fan" },
    {PA_6,  "fan1" },
    {PA_7,  "fan2" },

    //Servos
    {PA_2,  "servo0" },
	

	//Extension 1
	{PC_9, "PC9"},
	{PF_9, "PF9"},
	{PC_4, "PC4"},
	{PG_11, "PG11"},
	{PG_14, "PG14"},
	{PC_1, "PC1"},
	{PF_8, "PF8"},
	{PF_10, "PF10"},
	{PC_5, "PC5"},
	{PG_13, "PG13"},
	{PD_3, "PD3"},
	{PF_7, "PF7"},

	//Extension 2
	{PD_0, "PD0"},
	{PD_2, "PD2"},
	{PD_0, "PD5"},
	{PE_0, "PE0"},
	{PE_2, "PE2"},
	{PE_4, "PE4"},

	//Wifi
	{PA_0, "wifitx,TX4"},
	{PA_1, "wifirx,RX4"},
    //TFT
	{PA_9, "tfttx,TX1"},
	{PA_10, "tftrx,RX1"},
};

constexpr BoardDefaults biqu_skr_se_bx_v2_0_Defaults = {
    {0xf1832a2},                 	            // Signatures
    SD_SPI3_B,                                  // SD Card access
    {   //CLK, MISO, MOSI
        {NoPin, NoPin, NoPin},                  //SPI0
        {NoPin, NoPin, NoPin},                  //SPI1
        {PC_10, PC_11, PC_12},                  //SPI2
        {NoPin, NoPin, NoPin},                  //SPI3
        {NoPin, NoPin, NoPin},                  //SPI4
        {NoPin, NoPin, NoPin},                  //SPI5
        {PE_2,  PE_5,  PE_6},                   //SPI6
        {NoPin, NoPin, NoPin},                  //SPI7
        {NoPin, NoPin, NoPin},                  //SPI8
    },
	5,											// Number of drivers
    {PG_14, PB_4, PG_9, PC_15, PD_2},        	//enablePins
    {PG_13, PB_3, PD_7, PC_14, PA_8},	        //stepPins
    {PG_12, PD_3, PD_6, PC_13, PC_9},    	    //dirPins
#if HAS_SMART_DRIVERS
    {PG_10, PD_4, PD_5, PI_8, PC_8},            //uartPins
    5,                                      	// Smart drivers
#endif
    0,                                       	//digiPot Factor
#if HAS_VOLTAGE_MONITOR
    NoPin,
#endif
    PI_11,
#if HAS_SBC_INTERFACE
    PH_12, PH_10, SSP4,
#endif
};
# endif
constexpr PinEntry PinTable_BTT_SKR_3[] =
{
    //Thermistors
    {PA_1, "bedtemp,tb"},
    {PA_2, "e0temp,th0"},
    {PA_3, "e1temp,th1"},

    //Endstops
    {PC_1, "xstop"},
    {PC_3, "ystop"},
    {PC_0, "zstop"},
    {PC_2, "e0stop,e0det"},
    {PA_0, "e1stop,e1det"},

    //Servos
    {PE_5,  "servo0" },

    //Probe
    {PC_13, "probe"},

    //Heaters and Fans (Big and Small Mosfets}
    {PD_7,  "bed,hbed" },
    {PB_3,  "e0heat,heat0" },
    {PB_4,  "e1heat,heat1" },
    {PB_7,  "fan0,fan" },
    {PB_6,  "fan1" },
    {PB_5,  "fan2" },

    //Neopixel
    {PE_6, "Neopixel"},

    //PSON
    {PE_4, "PSON"},

    //PWRDET
    {PC_15, "PWRDET"},

    //Status LED
    {PA_13, "LED,status"},
	
    //EXP1
    {PC_5, "BEEP"},
    {PB_0, "BTNENC"},
    {PB_1, "LCDEN"},
    {PE_8, "LCDRS"},
    {PE_9, "LCDD4"},
    {PE_10, "LCDD5"},
    {PE_11, "LCDD6"},
    {PE_12, "LCDD7"},

    //EXP2
    {PA_6, "LCDMISO"},
    {PA_5, "LCDSCK"},
    {PE_7, "BTNEN1"},
    {PA_4, "LCDSS"},
    {PB_2, "BTNEN2"},
    {PA_7, "LCDMOSI"},
    {PC_4, "LCDCD"},
};

constexpr BoardDefaults btt_skr_3_Defaults = {
# if STM32H743xx
    {0xaa36a0c4},                             // Signatures
# elif STM32H723xx
    {0x132ea777},                             // Signatures
# endif
    SD_SDIO,                                  // SD Card access
    {   //CLK, MISO, MOSI
        {PA_5, PA_6, PA_7},                   //SPI0 EXP2
        {PB_13, PB_14, PB_15},                //SPI1 WiFi
        {NoPin, NoPin, NoPin},                //SPI2
        {PE_14, PE_15, PE_13},                //SPI3 Drivers
        {PC_5, PB_1, PB_0},                   //SPI4 Accelerometer
        {PE_9, NoPin, PB_1},                  //SPI5 RepRapDiscount Display
        {NoPin, NoPin, NoPin},                //SPI6
        {NoPin, NoPin, NoPin},                //SPI7
        {NoPin, NoPin, NoPin},                //SPI8
    },
    5,                            // Number of drivers
    {PD_6, PD_1, PE_0, PC_7, PD_13}, // enablePins
    {PD_4, PA_15, PE_2, PD_15, PD_11},  // stepPins
    {PD_3, PA_8, PE_3, PD_14, PD_10},    // dirPins
#if HAS_SMART_DRIVERS
    {PD_5, PD_0, PE_1, PC_6, PD_12},    // uartpins
    5,                            // Smart drivers
#endif
    0,                            // digiPot Factor
#if HAS_VOLTAGE_MONITOR
    NoPin,
#endif
    NoPin,
#if HAS_SBC_INTERFACE
    NoPin, NoPin, SSPNONE,
#endif
};

# if STM32H723xx

constexpr PinEntry PinTable_BTT_OCTOPUSPRO_V1_1[] =
{
    //Thermistors
    {PF_3, "bedtemp,tb"},
    {PF_4, "e0temp,th0"},
    {PF_5, "e1temp,th1"},
    {PF_6, "e2temp,th2"},
    {PF_7, "e3temp,th3"},

    //Endstops
    {PG_6, "xstop"},
    {PG_9, "ystop"},
    {PG_10, "zstop"},
    {PG_11, "e0stop,e0det"},
    {PG_12, "e1stop,e1det"},
    {PG_13, "e2stop,e2det"},
    {PG_14, "e3stop,e3det"},
    {PG_15, "e4stop,e4det"},

    //Servos
    {PB_6,  "servo0" },

    //Probe
    {PB_7, "probe"},
    {PC_5, "probe1"},

    //Heaters and Fans (Big and Small Mosfets}
    {PA_1,  "bed,hbed" },
    {PA_0,  "e0heat,heat0" },
    {PA_3,  "e1heat,heat1" },
    {PB_0, "e2heat,heat2" },
    {PB_11, "e3heat,heat3" },
    {PA_8,  "fan0,fan" },
    {PE_5,  "fan1" },
    {PD_12, "fan2" },
    {PD_13, "fan3" },
    {PD_14, "fan4" },
    {PD_15, "fan5" },

