gloomyandy/RepRapFirmware/src/Hardware/STM32/Boards/BIQU_SKR.h
    //EXP1
    {PE_15, "LCDD7"},
    {PE_13, "LCDD5"},
    {PE_10, "LCDRS"},
    {PE_7, "BTNENC"},
    {PE_8, "BEEP"},
    {PE_9, "LCDEN"},
    {PE_12, "LCDD4"},
    {PE_14, "LCDD6"},

    //EXP2
    {PC_15, "LCDCD"},
    {PB_2, "BTNEN2"},
    {PB_1, "BTNEN1"},
    {PA_6, "LCDMISO"},
    {PA_5, "LCDSCK"},
    {PA_4, "LCDSS"},
    {PA_7, "LCDMOSI"},

    //Neopixel
    {PB_10, "Neopixel"},

    //TFT
    {PA_9, "TX1,tfttx"},
    {PA_10, "RX1,tftrx"},
	{PD_6, "TX2"},
	{PD_5, "RX2"},

    //SPI
    {PC_4, "XCS"},
    {PD_11, "YCS"},
    {PC_6, "ZCS"},
    {PC_7, "E0CS"},
    {PF_2, "E1CS"},
    {PE_4, "E2CS"},
    {PE_1, "E3CS"},
    {PD_3, "E4CS"},
    {PA_6, "MISO"},
    {PA_7, "MOSI"},
    {PA_5, "SCK"},

    //I2C
    {PB_8, "SCL1"},
    {PB_9, "SDA1"},

    //PSON
    {PE_11, "PSON"},

    //PWRDET
    {PC_0, "PWRDET"},

    //Status LED
    {PA_13, "LED,status"},
};

constexpr BoardDefaults btt_octopuspro_Defaults = {
    {0x5450ab93},                               // Signatures
    SD_SDIO,                                    // SD Card access
    {   //CLK, MISO, MOSI
        {PA_5, PA_6, PA_7},                     //SPI0 Drivers + Screen + PT100
        {PB_13, PC_2, PC_3},                    //SPI1 WiFi
        {PB_3,  PB_4,  PB_5},                   //SPI2 SPI3 Header - J74
        {NoPin, NoPin, NoPin},                  //SPI3
        {PE_8, PE_9, PE_7},                     //SPI4 Accelerometer
        {PE_12, NoPin, PE_9},                   //SPI5 RepRapDiscount Display
    },
    8,                                          // Number of drivers
    {PF_14, PF_15, PG_5, PA_2, PG_2, PF_1, PD_4, PE_0}, // enablePins
    {PF_13, PG_0, PF_11, PG_4, PF_9, PC_13, PE_2, PE_6},// stepPins
    {PF_12, PG_1, PG_3, PC_1, PF_10, PF_0, PE_3,
#if STARTUP_DELAY
    NoPin
#else
    PA_14
#endif 
    },  // dirPins
#if HAS_SMART_DRIVERS
    {PC_4, PD_11, PC_6, PC_7, PF_2, PE_4, PE_1, PD_3},  // uartpins
    8,                                          // Smart drivers
#endif
    0,                                          // digiPot Factor
#if HAS_VOLTAGE_MONITOR
    NoPin,
#endif
    NoPin,
#if HAS_SBC_INTERFACE
    PD_10, PB_12, SSP2,
#endif
};


constexpr PinEntry PinTable_BTT_KRAKEN[] =
{
    //Thermistors
    {PB_0, "bedtemp"},
    {PB_1, "e0temp"},
    {PC_5, "e1temp"},
	{PC_4, "e2temp"},
	{PA_7, "e3temp"},

    //Endstops
    {PC_15, "xstop"},
    {PF_0, "ystop"},
    {PF_1, "zstop"},
    {PF_2, "e0stop"},
    {PF_3, "e1stop"},
	{PF_4, "e2stop"},
	{PF_10, "e3stop"},
	{PC_0, "e4stop"},

    //Servos
    {PE_9,  "servo0" },
	{PE_7,  "servo1" },

    //Probe
    {PG_1, "probe"},

    //Heaters and Fans (Big and Small Mosfets}
    {PF_5,  "bed" },
    {PF_6,  "e0heat" },
    {PF_7,  "e1heat" },
	{PF_9,  "e2heat" },
	{PF_8,  "e3heat" },
    {PA_0,  "fan0" },
    {PA_1,  "fan1" },
    {PA_2,  "fan2" },
	{PA_3,  "fan3" },
	{PA_4,  "fan4" },
	{PA_5,  "fan5" },
	{PA_6,  "fan6" },
	{PE_8,  "fan7" },
	{PC_1,  "fan6.tacho" },
	{PG_0,  "fan7.tacho" },

    //Neopixel
    {PF_12, "Neopixel"},
	{PF_11, "Neopixel1"},

    //PSON
    {PD_10, "PSON"},

    //IND-Det
    {PD_11, "INDDET"},
	
	//ADC
	{PC_2, "ADC1"},
	{PC_3, "ADC2"},
	{PB_10, "SCL2"},
	{PB_11, "SDA2"},
	
    //EXP1
    {PG_5, "BEEP"},
    {PG_4, "BTNENC"},
    {PG_3, "LCDEN"},
    {PG_2, "LCDRS"},
    {PD_15, "LCDD4"},
    {PD_14, "LCDD5"},
    {PD_13, "LCDD6"},
    {PD_12, "LCDD7"},

    //EXP2
    {PE_13, "LCDMISO"},
    {PE_12, "LCDSCK"},
    {PG_8, "BTNEN1"},
    {PE_11, "LCDSS"},
    {PG_7, "BTNEN2"},
    {PE_14, "LCDMOSI"},
    {PG_6, "LCDCD"},
};

constexpr BoardDefaults btt_kraken_Defaults = {
    {0x5450ab93, 0x26b1a20f},                             // Signatures
    SD_SPI2_A,                                  // SD Card access
    {   //CLK, MISO, MOSI
        {NoPin, NoPin, NoPin},                   //SPI0
        {PB_13, PB_14, PB_15},                //SPI1 SD Card
        {PC_10, PC_11, PC_12},                //SPI2 31865
        {PC_6, PC_7, PC_8},                //SPI3 Drivers
        {NoPin, NoPin, NoPin},                  //SPI4 31865
        {NoPin, NoPin, NoPin},                  //SPI5 RepRapDiscount Display
        {PE_12, PE_13, PE_14},                //SPI6 EXP2
        {NoPin, NoPin, NoPin},                //SPI7
        {NoPin, NoPin, NoPin},                //SPI8
    },
    8,                            // Number of drivers
    {PE_6, PE_3, PE_0, PB_7, PG_13, PG_12, PB_5, PG_14}, // enablePins
    {PC_14, PE_5, PE_2, PB_9, PG_9, PG_11, PB_4, PG_15},  // stepPins
    {PC_13, PE_4, PE_1, PB_8, PG_10, PD_7, PB_3, PB_6},    // dirPins
#if HAS_SMART_DRIVERS
    {PD_6, PD_5, PD_4, PD_3, PD_2, PA_15, PA_9, PA_10},    // uartpins
    8,                            // Smart drivers
#endif
    0,                            // digiPot Factor
#if HAS_VOLTAGE_MONITOR
    NoPin,
#endif
    NoPin,
#if HAS_SBC_INTERFACE
    NoPin, NoPin, SSPNONE,
#endif
};
# endif
#endif
#if STM32F4
constexpr PinEntry PinTable_BIQU_SKR_PRO_v1_1[] =
{
    //Thermistors
    {PF_3, "e0temp,t0"},
    {PF_4, "e1temp,t1"},
    {PF_5, "e2temp,t2"},
    {PF_6, "bedtemp,t3"},

    //Endstops
    {PB_10, "xstop"},
    {PE_12, "ystop"},
    {PG_8, "zstop"},
    {PE_15, "e0stop,e0det"},
    {PE_10, "e1stop,e1det"},
    {PG_5, "e2stop,e2det"},
    {PA_2, "probe"},

    //Heaters and Fans (Big and Small Mosfets}
    {PD_12,  "bed,hbed" },
    {PB_1,  "e0heat,he0" },
    {PD_14,  "e1heat,he1" },
    {PB_0,  "e2heat,he2" },
    {PC_8,  "fan0,fan" },
    {PE_5,  "fan1" },
    {PE_6,  "fan2" },

    //Servos
    {PA_1,  "servo0" },

    //EXP1
    {PG_4, "BEEP"},
    {PA_8, "BTNENC"},
    {PD_11, "LCDEN"},
    {PD_10, "LCDRS"},
    {PG_2, "LCDD4"},
    {PG_3, "LCDD5"},
    {PG_6, "LCDD6"},
    {PG_7, "LCDD7"},

    //EXP2
    {PB_14, "LCDMISO"},
    {PB_13, "LCDSCK"},
    {PG_10, "BTNEN1"},
    {PB_12, "LCDSS"},
    {PF_11, "BTNEN2"},
    {PB_15, "LCDMOSI"},
    {PF_12, "LCDCD"},
    {PF_13, "KILL"},

    //Wifi
    {PG_0, "wifi1"},
    {PG_1, "wifi2"},
    {PC_7, "wifi3"},
    {PC_6, "wifi4"},
    {PF_14, "wifi5"},
    {PF_15, "wifi6"},

    //SPI
    {PA_15, "XCS"},
    {PB_9, "ZCS"},
    {PB_8, "YCS"},
    {PB_3, "E0CS"},
    {PG_15, "E1CS"},
    {PG_12, "E2CS"},
	
	//Status LED
    {PA_13, "status"},

