gloomyandy/RepRapFirmware/src/Hardware/STM32/Boards/BIQU_SKR.h
};

constexpr BoardDefaults biquskr_pro_1_1_Defaults = {
    {0x768a39d6, 0x50da391, 0xa79a1917},        // Signatures
    SD_SPI1_A,                                  // SD Card access
    {   //CLK, MISO, MOSI
        {PA_5, PA_6, PB_5},                     //SPI0 SD Card
        {PB_13, PB_14, PB_15},                  //SPI1 WiFi
        {PC_10, PC_11, PC_12},                  //SPI2 Drivers and Accelerometer
        {PG_14, PC_1, PF_7},                    //SPI3 Screen
        {NoPin, NoPin, NoPin},                  //SPI4
        {NoPin, NoPin, NoPin},                  //SPI5
    },
    6,                                          // Number of drivers
    {PF_2, PD_7,  PC_0, PC_3,  PA_3, PF_0},     //enablePins
    {PE_9, PE_11, PE_13, PE_14,  PD_15, PD_13}, //stepPins
    {PF_1, PE_8, PC_2, PA_0,  PE_7, PG_9},      //dirPins
#if HAS_SMART_DRIVERS
    {PC_13, PE_3, PE_1, PD_4, PD_1, PD_6},      //uartPins
    6,                                          // Smart drivers
#endif
    0,                                          //digiPot Factor
#if HAS_VOLTAGE_MONITOR
    NoPin,
#endif
    NoPin,
#if HAS_SBC_INTERFACE
    PF_12, PB_12, SSP2,
#endif
};


constexpr PinEntry PinTable_BIQU_GTR_v1_0[] =
{
    //Thermistors
    {PC_1, "e0temp,t0"},
    {PC_2, "e1temp,t1"},
    {PC_3, "e2temp,t2"},
    {PC_0, "bedtemp,t3"},
    {PA_3, "e3temp,TempM1"},
    {PF_9, "e4temp,TempM2"},
    {PF_10, "e5temp,TempM3"},
    {PF_7, "e6temp,TempM4"},
    {PF_5, "e7temp,TempM5"},

    //Endstops
    {PF_2, "xstop"},
    {PC_13, "ystop"},
    {PE_0, "zstop"},
    {PG_14, "e0stop,e0det"},
    {PG_9, "e1stop,e1det"},
    {PD_3, "e2stop,e2det"},
    {PI_4, "e3stop,M1Stop"},
    {PF_4, "e4stop,M2Stop"},
    {PF_6, "e5stop,M3Stop"},
    {PI_7, "e6stop,M4Stop"},
    {PF_12, "e7stop,M5Stop"},
    {PH_11, "probe"},
    {PI_11, "EI1"},
    {PH_6, "EI2"},

    //Heaters and Fans (Big and Small Mosfets}
    {PA_2,  "bed,hbed" },
    {PB_1,  "e0heat,heat0" },
    {PA_1,  "e1heat,heat1" },
    {PB_0,  "e2heat,heat2" },
    {PD_15,  "e3heat,heatM1" },
    {PD_13,  "e4heat,heatM2" },
    {PD_12,  "e5heat,heatM3" },
    {PE_13,  "e6heat,heatM4" },
    {PI_6,  "e7heat,heatM5" },
    {PE_5,  "fan0" },
    {PE_6,  "fan1" },
    {PC_8,  "fan2" },
    {PI_5,  "fanM1" },
    {PE_9,  "fanM2" },
    {PE_11,  "fanM3" },
    {PC_9,  "fanM4" },
    {PE_14,  "fanM5" },

    //Servos
    {PB_11,  "servo0" },

    //EXP1
    {PC_11, "BEEP"},
    {PA_15, "BTNENC"},
    {PC_10, "LCDEN"},
    {PA_8, "LCDRS"},
    {PG_8, "LCDD4"},
    {PG_7, "LCDD5"},
    {PG_6, "LCDD6"},
    {PG_5, "LCDD7"},

    //EXP2
    {PB_14, "LCDMISO"},
    {PB_13, "LCDSCK"},
    {PD_10, "BTNEN1"},
    {PB_12, "LCDSS"},
    {PH_10, "BTNEN2"},
    {PB_15, "LCDMOSI"},
    {PB_10, "LCDCD"},

    //Neopixel
    {PF_13, "Neopixel"},

    //Wifi
    {PF_11, "wifi1"},
    {PC_7, "wifi3"},
    {PC_6, "wifi4"},
    {PC_5, "wifi5"},

    //SPI
    {PC_14, "XCS"},
    {PE_1, "YCS"},
    {PB_5, "ZCS"},
    {PG_10, "E0CS"},
    {PD_4, "E1CS"},
    {PC_12, "E2CS"},
    {PB_6, "MISO"},
    {PG_15, "MOSI"},
    {PB_3, "SCK"},

    //Extra M5
    {PI_2, "KMOSI"},
    {PI_1, "KSCK"},
    {PH_2, "KCS"},
    {PF_13, "RGBLED"},
	//Status LED
    {PA_0, "status"},

};

constexpr BoardDefaults biqu_gtr_1_0_Defaults = {
    {0x94a2cc03},                               // Signatures
    SD_SPI1_B,                                  // SD Card access
    {   //CLK, MISO, MOSI
        {PA_5, PA_6, PA_7},                     //SPI0 SD Card
        {PB_13, PB_14, PB_15},                  //SPI1 WiFi
        {NoPin, NoPin, NoPin},                  //SPI2
        {PI_9, PB_11, PH_11},                   //SPI3 Screen
        {PI_1, PI_2, NoPin},                    //SPI4 Thermocouple
        {PB_3, PB_6, PG_15},                    //SPI5 Drivers
    },
    6+5,                                        // Number of drivers GTR + M5
    {PF_1, PE_4,  PB_9, PG_13,  PD_7, PD_2,PF_8,PG_2,PF_4,PE_8,PI_0},    //enablePins including M5
    {PC_15, PE_3, PB_8, PG_12,  PD_6, PD_1,PF_3,PD_14,PE_12,PG_0,PH_12},    //stepPins Including M5
    {PF_0, PE_2, PB_7, PG_11,  PD_5, PD_0,PG_3,PD_11,PE_10,PG_1,PH_15}, //dirPins Including M5
#if HAS_SMART_DRIVERS
    {PC_14, PE_1, PB_5, PG_10, PD_4, PC_12,PG_4,PE_15,PE_7,PF_15,PH_14},  //uartpins including M5
    6,                                      // Smart drivers or 11 with M5
#endif
    0,                                       //digiPot Factor
#if HAS_VOLTAGE_MONITOR
    NoPin,
#endif
    NoPin,
#if HAS_SBC_INTERFACE
    PB_10, PB_12, SSP2,
#endif
};

constexpr PinEntry PinTable_BTT_RRF_E3_v1_1[] =
{
    //Thermistors
    {PA_0, "e0temp,th0"},
    {PA_1, "bedtemp,tb"},
    {PA_2, "e1temp,th1"},
    {PA_3, "PT100,th2"},

    //Endstops
    {PC_0, "xstop"},
    {PC_1, "ystop"},
    {PC_2, "zstop"},
    {PC_3, "e0stop,e0det"},
    {PB_10, "e1stop"},
    {PB_11, "x2stop"},
    {PE_3, "IO"},

    //Servos
    {PB_0,  "servo0" },

    //Probe
    {PC_5, "probe"},

    //Heaters and Fans (Big and Small Mosfets}
    {PB_4,  "bed,hbed" },
    {PB_3,  "e0heat,heat0" },
    {PE_4,  "e1heat" },
    {PB_5,  "fan0,fan" },
    {PB_6,  "fan1" },
    {PE_5,  "fan2" },
    {PE_6,  "fan3" },

    //EXP1
    {PB_1, "LCDD6"},
    {PB_2, "LCDD4"},
    {PE_7, "LCDEN"},
    {PE_8, "BEEP"},
    {PE_9,"BTNENC"},
    {PE_10, "LCDD5"},
    {PE_11,"LCDD7"},

    //Neopixel
    {PB_7, "Neopixel"},

    //TFT
    {PA_9, "TX1,tfttx"},
    {PA_10, "RX1,tftrx"},

    //UART
    {PB_8, "SDA1"},
    {PB_9, "SCL1"},

    //PSON
    {PE_1, "PSON"},

    //PWRDET
    {PE_0, "PWRDET"},

    //Status LED
    {PE_2, "LED,status"},

};

constexpr BoardDefaults btt_rrf_e3_1_1_Defaults = {
    {0x94a2cc03, 0xb173b733},                   // Signatures
    SD_SDIO,                                    // SD Card access
    {   //CLK, MISO, MOSI
        {NoPin, NoPin, NoPin},                  //SPI0
        {PB_13, PB_14, PB_15},                  //SPI1 WiFi
        {NoPin, NoPin, NoPin},                  //SPI2
        {NoPin, NoPin, NoPin},                  //SPI3
        {PE_10, NoPin, PE_11},                  //SPI4 Ender Screen
        {PB_1, PB_2, PE_11},                    //SPI5 Accelerometer
    },
    6,                                          // Number of drivers
    {PD_7, PD_3, PD_14, PD_10, PC_13, PE_15},   // enablePins
    {PD_5, PD_0, PC_6, PD_12, PC_15, PE_13},    // stepPins
    {PD_4, PA_15, PC_7, PD_13, PA_8, PE_12},    // dirPins
#if HAS_SMART_DRIVERS
    {PD_6, PD_1, PD_15, PD_11, PC_14, PE_14},   // uartpins
    4,                                          // Smart drivers
#endif
    0,                                          // digiPot Factor
#if HAS_VOLTAGE_MONITOR
    NoPin,
#endif
    NoPin,
#if HAS_SBC_INTERFACE
    NoPin, NoPin, SSPNONE,
#endif
};

constexpr PinEntry PinTable_BTT_SKR_2[] =
{
    //Thermistors
    {PA_1, "bedtemp,tb"},
    {PA_2, "e0temp,th0"},
    {PA_3, "e1temp,th1"},

    //Endstops
    {PC_1, "xstop"},
    {PC_3, "ystop"},
    {PC_0, "zstop"},
    {PC_2, "e0stop,e0det"},
    {PA_0, "e1stop,e1det"},

    //Servos
    {PE_5,  "servo0" },

    //Probe
    {PE_4, "probe"},

    //Heaters and Fans (Big and Small Mosfets}
    {PD_7,  "bed,hbed" },
    {PB_3,  "e0heat,heat0" },
    {PB_4,  "e1heat,heat1" },
    {PB_7,  "fan0,fan" },
    {PB_6,  "fan1" },
    {PB_5,  "fan2" },

